---
kind: method
id: M:Autodesk.Revit.DB.LinePatternSegment.#ctor
source: html/b126b034-ce5e-2c58-9029-e1bb5ae035bc.htm
---
# Autodesk.Revit.DB.LinePatternSegment.#ctor Method

Creates a line pattern segment.

## Syntax (C#)
```csharp
public LinePatternSegment()
```